## Plan Result (prod)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 13 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * module.utiac.azurerm_key_vault_secret.subuser
  * module.utiac.azurerm_key_vault_secret.subuser-api-key
  * module.utiac.random_password.password
  * module.utiac.sendgrid_api_key.subuser
  * module.utiac.sendgrid_domain_authentication.domain-authenticate[&#34;tribunalsdecisions-utiac.platform.service.gov.uk&#34;]
  * module.utiac.sendgrid_subuser.user
  * module.utiac-dns.azurerm_dns_cname_record.record1[&#34;tribunalsdecisions-utiac.platform.service.gov.uk&#34;]
  * module.utiac-dns.azurerm_dns_cname_record.record2[&#34;tribunalsdecisions-utiac.platform.service.gov.uk&#34;]
  * module.utiac-dns.azurerm_dns_cname_record.record3[&#34;tribunalsdecisions-utiac.platform.service.gov.uk&#34;]
* Replace
  * module.pcol.sendgrid_domain_authentication.domain-authenticate[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record1[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record2[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record3[&#34;hmcts.net&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.pcol.sendgrid_domain_authentication.domain-authenticate["hmcts.net"] must be replaced
-/+ resource "sendgrid_domain_authentication" "domain-authenticate" {
      + custom_dkim_selector = "prd" # forces replacement
      - custom_spf           = false -> null
      ~ dns                  = [
          - {
              - data  = "prd.domainkey.u33702743.wl244.sendgrid.net"
              - host  = "prd._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "prd2.domainkey.u33702743.wl244.sendgrid.net"
              - host  = "prd2._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "u33702743.wl244.sendgrid.net"
              - host  = "em2696.hmcts.net"
              - type  = "cname"
              - valid = false
            },
        ] -> (known after apply)
      ~ id                   = "19892787" -> (known after apply)
      ~ ips                  = [] -> (known after apply)
      ~ subdomain            = "em2696" -> (known after apply)
      ~ username             = "hmcts-pcol-prod" -> (known after apply)
      ~ valid                = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record1["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record1" {
      ~ fqdn                = "prd._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/prd._domainkey" -> (known after apply)
      ~ name                = "prd._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "prd.domainkey.u33702743.wl244.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record2["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record2" {
      ~ fqdn                = "prd2._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/prd2._domainkey" -> (known after apply)
      ~ name                = "prd2._domainkey" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "prd2.domainkey.u33702743.wl244.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record3["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record3" {
      ~ fqdn                = "em2696.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/em2696" -> (known after apply)
      ~ name                = "em2696" # forces replacement -> (known after apply) # forces replacement
      ~ record              = "u33702743.wl244.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (3 unchanged attributes hidden)
    }

  # module.utiac.azurerm_key_vault_secret.subuser will be created
  + resource "azurerm_key_vault_secret" "subuser" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-utiac-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.utiac.azurerm_key_vault_secret.subuser-api-key will be created
  + resource "azurerm_key_vault_secret" "subuser-api-key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/SendGrid-prod/providers/Microsoft.KeyVault/vaults/sendgridprod"
      + name                    = "hmcts-utiac-api-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.utiac.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 1
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "_%@"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.utiac.sendgrid_api_key.subuser will be created
  + resource "sendgrid_api_key" "subuser" {
      + api_key = (sensitive value)
      + id      = (known after apply)
      + name    = "utiac-application"
      + scopes  = [
          + "2fa_required",
          + "mail.send",
          + "sender_verification_eligible",
          + "whitelabel.create",
          + "whitelabel.delete",
          + "whitelabel.read",
          + "whitelabel.update",
        ]
    }

  # module.utiac.sendgrid_domain_authentication.domain-authenticate["tribunalsdecisions-utiac.platform.service.gov.uk"] will be created
  + resource "sendgrid_domain_authentication" "domain-authenticate" {
      + automatic_security = true
      + dns                = (known after apply)
      + domain             = "tribunalsdecisions-utiac.platform.service.gov.uk"
      + id                 = (known after apply)
      + ips                = (known after apply)
      + is_default         = true
      + subdomain          = (known after apply)
      + username           = (known after apply)
      + valid              = (known after apply)
    }

  # module.utiac.sendgrid_subuser.user will be created
  + resource "sendgrid_subuser" "user" {
      + authorization_token    = (known after apply)
      + credit_allocation_type = (known after apply)
      + disabled               = (known after apply)
      + email                  = "DTSPlatformOps@HMCTS.NET"
      + id                     = (known after apply)
      + ips                    = [
          + "167.89.74.8",
        ]
      + password               = (sensitive value)
      + signup_session_token   = (known after apply)
      + user_id                = (known after apply)
      + username               = "hmcts-utiac-prod"
    }

  # module.utiac-dns.azurerm_dns_cname_record.record1["tribunalsdecisions-utiac.platform.service.gov.uk"] will be created
  + resource "azurerm_dns_cname_record" "record1" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "tribunalsdecisions.service.gov.uk"
    }

  # module.utiac-dns.azurerm_dns_cname_record.record2["tribunalsdecisions-utiac.platform.service.gov.uk"] will be created
  + resource "azurerm_dns_cname_record" "record2" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "tribunalsdecisions.service.gov.uk"
    }

  # module.utiac-dns.azurerm_dns_cname_record.record3["tribunalsdecisions-utiac.platform.service.gov.uk"] will be created
  + resource "azurerm_dns_cname_record" "record3" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + record              = (known after apply)
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "tribunalsdecisions.service.gov.uk"
    }

Plan: 13 to add, 0 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":65,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->